{
  "header": {
    "home": "Inicio",
    "about": "Sobre Mí",
    "skills": "Conocimientos",
    "experiences": "Experiencias",
    "projects": "Proyectos",
    "contact": "Contacto",
    "iconMenuAria": "Abrir menú",
    "iconConfigAria": "Ajustes"
  },
  "homeContent": {
    "welcome": "¡Hola, Bienvenido!",
    "apresentation": "Soy Vinícius Guedes",
    "occupation": "Ingeniero de Software Full Stack"
  },
  "aboutContent": {
    "aboutTitle": "Sobre Mí",
    "aboutText": "Me llamo Vinícius, tengo 23 años y soy graduado en Análisis y Desarrollo de Sistemas. Actualmente, trabajo como Full Stack Software Engineer y me apasiona la tecnología y el desarrollo de software.\n\nTengo un gran interés por la innovación y siempre busco mejorar mis habilidades, explorar nuevas tecnologías y seguir las mejores prácticas del mercado para ofrecer soluciones eficientes, escalables y bien estructuradas.\n\nMi objetivo profesional es seguir evolucionando en el área de desarrollo, participar en proyectos desafiantes y, en el futuro, conseguir una oportunidad de trabajo en el extranjero, donde podré ampliar mis conocimientos, intercambiar experiencias con profesionales de diferentes culturas y contribuir al crecimiento de empresas a nivel global."
  },
  "skillsContent": {
    "defaultSkillsDescription": "*Pasa el cursor sobre la tarjeta para leer*",
    "htmlDescription": "HTML es el lenguaje de marcado utilizado para estructurar páginas web.",
    "cssDescription": "CSS es el lenguaje de estilo utilizado para definir el diseño y la apariencia de las páginas web.",
    "jsDescription": "JavaScript es un lenguaje de programación utilizado para crear interactividad en sitios web.",
    "reactDescription": "React es una biblioteca de JavaScript para la construcción de interfaces de usuario reactivas.",
    "nextDescription": "Next.js es un framework de React que facilita la renderización del lado del servidor y el desarrollo de aplicaciones web.",
    "tailwindDescription": "Tailwind CSS es un framework de estilos basado en clases utilitarias.",
    "tsDescription": "TypeScript es un superset de JavaScript que agrega tipado estático al código.",
    "cypressDescription": "Cypress es un framework de pruebas end-to-end para aplicaciones web.",
    "javaDescription": "Java es un lenguaje de programación orientado a objetos ampliamente utilizado para el desarrollo backend.",
    "springDescription": "Spring Boot es un framework de Java que facilita el desarrollo de API y aplicaciones backend robustas.",
    "dotnetDescription": ".NET es una plataforma de Microsoft para el desarrollo de aplicaciones backend y de escritorio.",
    "databaseDescription": "Las bases de datos son sistemas utilizados para almacenar, organizar y recuperar información estructurada.",
    "rabbitmqDescription": "RabbitMQ es un message broker que facilita la comunicación entre microservicios.",
    "gitDescription": "Git es un sistema de control de versiones distribuido utilizado para gestionar código fuente.",
    "dockerDescription": "Docker es una plataforma para crear, distribuir y ejecutar aplicaciones en contenedores.",
    "awsDescription": "AWS (Amazon Web Services) es una plataforma de computación en la nube de Amazon.",
    "experienceTimeText": "Tiempo de experiencia",
    "monthText": "Mes(es)"
  },
  "experiencesContent": {
    "experiencesTitle": "Experiencias Laborales",
    "experiencesText": "Actualmente, tengo 9 meses de experiencia en desarrollo de software. En mi primer empleo, trabajé como Desarrollador Junior en un equipo pequeño, compuesto por mí y un desarrollador senior. Trabajamos en un proyecto de gestión de contenidos, que incluye:\n\n- API Backend en Java con Spring Boot\n- Portal público\n- Portal externo\n- Panel administrativo para gestión de contenidos\n\nCuando ingresé a la empresa, este proyecto ya llevaba 3 años en desarrollo. Con el tiempo, asumí varias responsabilidades de forma independiente, siempre contando con la orientación de mi compañero senior. A pesar de los desafíos, logramos avanzar significativamente y el proyecto está cerca de su conclusión.\n\nPrincipales tecnologías utilizadas: Java 11, Spring Boot, Angular 12, GitLab y Docker.\n\nA partir de marzo de 2025, comenzaré en una nueva empresa, donde espero adquirir más experiencia trabajando en equipo, participar en grandes proyectos y seguir las mejores prácticas del mercado.\n\nPrincipales tecnologías que utilizaré en esta nueva experiencia: C#, .NET Core, React.js, Next.js y Docker."
  },
  "projectsContent": {
    "tripBuilderTitle": "Trip Builder",
    "tripBuilderDescription": "Un proyecto SaaS para la generación de itinerarios de viaje",
    "tripBuilderContent": "Tecnologías utilizadas: Next.js, Java 23, Spring, RabbitMQ, IA, Postgres SQL, Docker, AWS, CDN",
    "tripBuilderFooter": "Proyecto privado, estará disponible pronto",
    "rentifyTitle": "Rentify",
    "rentifyDescription": "Proyecto inspirado en las plataformas Booking y Airbnb",
    "rentifyContent": "Tecnologías utilizadas: Next.Js, Java 23, Spring, Postgres SQL, Docker",
    "rentifyFooter": "Proyecto en desarrollo"
  },
  "footerContent": {
    "rightsReserved": "Todos los derechos reservados."
  },
  "contactsContent": {
    "contactsTitle": "Contáctame",
    "nameMinMessage": "El nombre debe tener al menos 3 caracteres.",
    "nameMaxMessage": "El nombre no puede tener más de 100 caracteres.",
    "nameLabel": "Nombre Completo",
    "namePlaceHolder": "Escribe tu nombre...",
    "nameDescription": "Tu nombre completo aparecerá en el correo electrónico.",
    "emailRequiredMessage": "El correo electrónico es obligatorio.",
    "emailInvalidMessage": "Dirección de correo electrónico no válida.",
    "emailPlaceHolder": "Escribe tu correo electrónico...",
    "emailDescription": "Asegúrate de ingresar una dirección de correo electrónico válida.",
    "messageMinMessage": "El mensaje debe tener al menos 3 caracteres.",
    "messageMaxMessage": "El mensaje no puede tener más de 5000 caracteres.",
    "messageLabel": "Mensaje",
    "messagePlaceHolder": "Escribe tu mensaje...",
    "messageDescription": "Tu mensaje debe tener entre 3 y 5000 caracteres.",
    "submitBtn": "Enviar",
    "submitBtnLoading": "Enviando...",
    "messageSuccesSendEmail": "Correo electrónico enviado con éxito.",
    "messageErrorSendEmail": "Error al enviar el correo electrónico. Por favor, inténtalo de nuevo."
  }
}
