{
  "header": {
    "home": "Início",
    "about": "Sobre Mim",
    "skills": "Conhecimentos",
    "experiences": "Experiencias",
    "projects": "Projetos",
    "contact": "Contato",
    "iconMenuAria": "Abrir menu",
    "iconConfigAria": "Configurações"
  },
  "homeContent": {
    "welcome": "Olá, Seja bem vindo!",
    "apresentation": "Eu sou Vinícius Guedes",
    "occupation": "Full Stack Software Engineer"
  },
  "aboutContent": {
    "aboutTitle": "Sobre Mim",
    "aboutText": "Me chamo Vinícius, tenho 23 anos e sou formado em Análise e Desenvolvimento de Sistemas. Atualmente, atuo como Full Stack Software Engineer e sou apaixonado por tecnologia e desenvolvimento de software.\n\nTenho um grande interesse por inovação e estou sempre em busca de aprimorar minhas habilidades, explorar novas tecnologias e seguir as melhores práticas do mercado para entregar soluções eficientes, escaláveis e bem estruturadas.\n\nMeu objetivo profissional é continuar evoluindo na área de desenvolvimento, atuar em projetos desafiadores e, no futuro, conquistar uma oportunidade de trabalho no exterior, onde poderei expandir meus conhecimentos, trocar experiências com profissionais de diferentes culturas e contribuir para o crescimento de empresas globalmente."
  },
  "skillsContent": {
    "defaultSkillsDescription": "*Passe o cursor do mouse no card para ler*",
    "htmlDescription": "HTML é a linguagem de marcação utilizada para estruturar páginas da web.",
    "cssDescription": "CSS é a linguagem de estilização usada para definir o design e layout das páginas web.",
    "jsDescription": "JavaScript é uma linguagem de programação usada para criar interatividade em sites.",
    "reactDescription": "React é uma biblioteca JavaScript para a construção de interfaces de usuário reativas.",
    "nextDescription": "Next.js é um framework React que facilita a renderização server-side e o desenvolvimento de aplicações web.",
    "tailwindDescription": "Tailwind CSS é um framework de estilização baseado em classes utilitárias.",
    "tsDescription": "TypeScript é um superset do JavaScript que adiciona tipagem estática ao código.",
    "cypressDescription": "Cypress é um framework de testes end-to-end para aplicações web.",
    "javaDescription": "Java é uma linguagem de programação orientada a objetos amplamente usada para desenvolvimento backend.",
    "springDescription": "Spring Boot é um framework Java que facilita o desenvolvimento de APIs e aplicações backend robustas.",
    "dotnetDescription": ".NET é uma plataforma da Microsoft para desenvolvimento de aplicações backend e desktop.",
    "databaseDescription": "Banco de dados são sistemas usados para armazenar, organizar e recuperar informações estruturadas.",
    "rabbitmqDescription": "RabbitMQ é um message broker que facilita a comunicação entre microsserviços.",
    "gitDescription": "Git é um sistema de controle de versão distribuído usado para gerenciar código-fonte.",
    "dockerDescription": "Docker é uma plataforma para criar, distribuir e executar aplicações em contêineres.",
    "awsDescription": "AWS (Amazon Web Services) é uma plataforma de serviços em nuvem da Amazon.",
    "experienceTimeText": "Tempo de experiência",
    "monthText": "Mês(es)"
  },
  "experiencesContent": {
    "experiencesTitle": "Experiências de Trabalho",
    "experiencesText": "Atualmente, tenho 9 meses de experiência no desenvolvimento de software. No meu primeiro emprego, atuei como Desenvolvedor Júnior em uma equipe enxuta, composta por mim e um desenvolvedor sênior. Trabalhamos em um projeto de gerenciamento de conteúdos, que inclui:\n\n- API Backend em Java com Spring Boot\n- Portal público\n- Portal externo\n- Painel administrativo para gerenciamento de conteúdos\n\nQuando entrei na empresa, este projeto já estava em desenvolvimento há 3 anos. Ao longo do tempo, assumi diversas responsabilidades de forma independente, sempre contando com a orientação do meu colega sênior. Apesar dos desafios, conseguimos avançar significativamente, e o projeto está próximo da conclusão.\n\nPrincipais tecnologias utilizadas: Java 11, Spring Boot, Angular 12, GitLab e Docker.\n\nA partir de março de 2025, iniciarei em uma nova empresa, onde espero ganhar mais experiência em trabalho em equipe, atuar em grandes projetos e seguir boas práticas de mercado.\n\nPrincipais tecnologias que utilizarei nessa nova experiência: C#, .NET Core, React.js, Next.js e Docker."
  },
  "projectsContent": {
    "projectsTitle": "Projetos",
    "tripBuilderTitle": "Trip Builder",
    "tripBuilderDescription": "Um projeto sass para geração de roteiros de viagem",
    "tripBuilderContent": "Tecnologias utilizadas: Next.Js, Java 23, Spring, RabbitMQ, IA, Postgres SQL, Docker, AWS, CDN",
    "tripBuilderFooter": "Projeto privado, estará disponível em breve",
    "rentifyTitle": "Rentify",
    "rentifyDescription": "Projeto inspirado nas plataformas Booking e Airbnb",
    "rentifyContent": "Tecnologias utilizadas: Next.Js, Java 23, Spring, Postgres SQL, Docker",
    "rentifyFooter": "Projeto em desenvolvimento"
  },
  "footerContent": {
    "rightsReserved": "Todos os direitos reservados."
  },
  "contactsContent": {
    "contactsTitle": "Fale comigo",
    "nameMinMessage": "Nome deve ter ao menos 3 caracteres.",
    "nameMaxMessage": "Nome não pode ter mais de 100 caracteres.",
    "nameLabel": "Nome Completo",
    "namePlaceHolder": "Digite seu nome...",
    "nameDescription": "Seu nome completo aparecerá no email.",
    "emailRequiredMessage": "Email é obrigatório.",
    "emailInvalidMessage": "Endereço de email inválido.",
    "emailPlaceHolder": "Digite seu email...",
    "emailDescription": "Certifique-se de inserir um endereço de e-mail válido.",
    "messageMinMessage": "Mensagem deve ter ao menos 3 caracteres.",
    "messageMaxMessage": "Mensagem não pode ter mais de 5000 caracteres.",
    "messageLabel": "Mensagem",
    "messagePlaceHolder": "Digite sua mensagem...",
    "messageDescription": "Sua mensagem deve ter entre 3 a 5000 caracteres.",
    "submitBtn": "Enviar",
    "submitBtnLoading": "Enviando...",
    "messageSuccesSendEmail": "Email enviado com sucesso.",
    "messageErrorSendEmail": "Erro ao enviar email. Por favor, tente novamente."
  }
}
